package com.brilliant.module;

import com.brilliant.R;
import com.brilliant.base.BaseFragment;

/**
 * description:
 * Date: 2017/2/13 11:10
 * User: Administrator
 */
public class ModelFragment extends BaseFragment {

    //======================================= 自定义变量 start ======================================


    //======================================= 自定义变量 end ========================================

    //======================================= 重写自定义方法 start ==================================

    @Override
    protected int attachLayoutRes() {
        return R.layout.activity_model;
    }

    @Override
    protected void initInjector() {

    }

    @Override
    protected void initViews() {

    }

    @Override
    protected void updateViews(boolean isRefresh) {

    }

    //====================================== 重写自定义方法 end =====================================

    //====================================== 自定义方法 start =======================================

    //====================================== 自定义方法 end =========================================

    //====================================== 重写系统方法 start =====================================

    //====================================== 重写自定义方法 end =====================================

    //====================================== 自定义方法 start =======================================

    //======================================= 自定义方法 end ========================================

    //======================================= 重写系统方法 start ====================================

    //======================================== 重写系统方法 end =====================================
}
