package com.brilliant.demo;

import com.brilliant.R;
import com.brilliant.base.BaseFragment;

/**
 * fragment模板，所有新建的fragment都应该复制该文件然后自定义
 * description:
 * Date: 2017/2/13 11:10
 * User: Administrator
 */
public class ModelFragment extends BaseFragment {

    //#################################################################### 自定义变量 start


    //#################################################################### 自定义变量 end

    //#################################################################### 重写自定义方法 start

    @Override
    protected int getLayoutResource() {
        return R.layout.activity_model;
    }

    @Override
    public void initPresenter() {

    }

    @Override
    protected void initView() {

    }

    @Override
    public void initData() {

    }

    //#################################################################### 重写自定义方法 end

    //#################################################################### 自定义方法 start

    //#################################################################### 自定义方法 end

    //#################################################################### 重写系统方法 start

    //#################################################################### 重写自定义方法 end

    //#################################################################### 自定义方法 start

    //#################################################################### 自定义方法 end

    //#################################################################### 重写系统方法 start

    //#################################################################### 重写系统方法 end
}
